<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Adobe Shockwave Player disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>lan.sciurus.autopkg.munki.Adobe.ShockwavePlayer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobeShockwavePlayer</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Plugins/Adobe Shockwave Player</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>lan.sciurus.autopkg.download.Adobe.ShockwavePlayer</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%/*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>AdobeShockwaveVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_file_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Distribution</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Shockwave12.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Library</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/Library/Internet Plug-Ins/DirectorShockwave.plugin</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>name</key>
                    <string>%NAME%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>catalogs</key>
                    <array>
                        <string>testing</string>
                    </array>
                    <key>description</key>
                    <string>Adobe Shockwave Player Plugin for Web Browsers</string>
                    <key>display_name</key>
                    <string>Adobe Shockwave Player</string>
                    <key>name</key>
                    <string>%NAME%</string>
                    <key>unattended_install</key>
                    <true/>
                    <key>category</key>
                    <string>Plugins</string>
                    <key>developer</key>
                    <string>Adobe Ltd.</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
