<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Installs the current release version of LibreOffice.</string>
	<key>Identifier</key>
	<string>lan.sciurus.install.LibreOffice</string>
	<key>Input</key>
	<dict>
		<key>Name</key>
		<string>LibreOffice</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>lan.sciurus.download.LibreOffice</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>InstallFromDMG</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
				<key>items_to_copy</key>
				<array>
					<dict>
						<key>source_item</key>
						<string>LibreOffice.app</string>
						<key>destination_path</key>
						<string>/Applications/</string>
					</dict>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
