<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Keka.</string>
    <key>Identifier</key>
    <string>lan.sciurus.download.aOne.Keka</string>
    <key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
    <true />
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Keka</string>
        <key>DOWNLOAD_URL</key>
        <string>http://download.kekaosx.com/</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
