<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads Keka and imports into Munki.</string>
        <key>Identifier</key>
      <string>lan.sciurus.munki.Keka</string>
      <key>Input</key>
      <dict>
          <key>MUNKI_REPO_SUBDIR</key>
          <string>Tools/File Exchange/%NAME%</string>
          <key>MUNKI_CATEGORY</key>
          <string>Tools</string>
          <key>NAME</key>
          <string>Keka</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>Keka is a free file archiver for Mac OS X.</string>
                <key>developer</key>
                <string>aOne</string>
                <key>display_name</key>
                <string>Keka</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.1</string>
        <key>ParentRecipe</key>
        <string>lan.sciurus.download.Keka</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
