<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Lädt den aktuellsten MunkiReport-Installer herunter und importiert es in das Munki-Repo.
    </string>
    <key>Identifier</key>
    <string>lan.sciurus.munki.munkireport-office</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MunkiReport-Office</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Tools/Deployment/%NAME%</string>
        <key>modules</key>
        <array>
        </array>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>MunkiReport sammelt Informationen über Systemparameter und fasst diese in einer Übersicht zusammen.</string>
            <key>display_name</key>
            <string>MunkiReport Office</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>lan.sciurus.pkg.munkireport-office</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
