<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Outlook 2016 multilingual update pkg, appends the version to the end of the filename, and imports into Munki.</string>
    <key>Identifier</key>
    <string>lan.sciurus.autopkg.munki.Microsoft.Office.Outlook.2016</string>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MicrosoftOutlook2016</string>
        <key>munki_required_update_name</key>
        <string></string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>Microsoft Outlook</string>
                <string>Microsoft Error Reporting</string>
                <string>Microsoft Auto Update</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>lan.sciurus.autopkg.download.Microsoft.Office.Outlook.2016</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>Merge input pkginfo and additional_pkginfo generated by MSOffice2016URLandUpdateInfoProvider</string>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>Office/Suites/Microsoft Office/2016/Outlook</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
