<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Finds latest Office 2011 update, downloads the disk image and extracts the pkg.</string>
    <key>Identifier</key>
    <string>lan.sciurus.autopkg.pkg.MicrosoftOffice2011Updates</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Office2011_Update</string>
        <key>VERSION</key>
        <string>latest</string>
        <key>CULTURE_CODE</key>
        <string>0407</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>lan.sciurus.autopkg.download.MicrosoftOffice2011Updates</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/%pkg_name%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
