<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of ApacheDirectoryStudio and imports it into Munki.</string>
	<key>Identifier</key>
	<string>lan.sciurus.autopkg.munki.Apache.DirectoryStudio</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Tools/Network/%NAME%</string>
		<key>NAME</key>
		<string>ApacheDirectoryStudio</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Complete LDAP tooling platform.</string>
			<key>developer</key>
			<string>Apache</string>
			<key>category</key>
			<string>Tools</string>
			<key>display_name</key>
			<string>ApacheDirectoryStudio</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>lan.sciurus.autopkg.download.Apache.DirectoryStudio</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%pkg_path%</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%-%version%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>FileMover</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
