<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest OpenOffice.</string>
	<key>Identifier</key>
	<string>lan.sciurus.download.Apache.OpenOffice</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OpenOffice</string>
		<key>LANGUAGE</key>
		<string>de</string>
		<key>BASE_URL</key>
		<string>https://www.apache.org/dyn/closer.lua/openoffice/</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>OpenOfficeURLProvider</string>
			<key>Arguments</key>
			<dict>
				<key>base_url</key>
				<string>%BASE_URL%</string>
				<key>language_code</key>
				<string>%LANGUAGE%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
