<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Adobe Flash Player installer, imports into Munki.</string>
    <key>Identifier</key>
    <string>lan.sciurus.autopkg.munki.AdobeFlashPlayer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobeFlashPlayer</string>
        <key>product_directory</key>
        <string>Plugins/Adobe Flash Player/</string>
        <key>MAKEPKGINFO_PKGNAME</key>
        <string>Install Adobe Flash Player.app/Contents/Resources/Adobe Flash Player.pkg</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Adobe® Flash® Player ist ein plattformübergreifendes Plugin zur Wiedergabe von Multimediainhalten im Internet.</string>
            <key>display_name</key>
            <string>Adobe Flash Player</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>lan.sciurus.autopkg.download.AdobeFlashPlayer</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%product_directory%</string>
                <key>munkiimport_pkgname</key>
                <string>%MAKEPKGINFO_PKGNAME%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
