<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release version of MacVim for OS X where MAJOR_OS_VERSION is Snow-Leopard, Mountain-Lion or Mavericks (default).</string>
    <key>Identifier</key>
    <string>lan.sciurus.download.MacVim</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MacVim</string>
        <key>MAJOR_OS_VERSION</key>
        <string>Mavericks</string>
		<key>REPO_OWNER</key>
		<string>b4winckler</string>
		<key>REPO_NAME</key>
		<string>macvim</string>
        	<key>SEARCH_PATTERN</key>
        	<string>&lt;a href="(/.*-%MAJOR_OS_VERSION%\.tbz)"</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://github.com/%REPO_OWNER%/%REPO_NAME%/releases</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
                		<string>https://github.com%match%</string>
				<key>filename</key>
				<string>%NAME%.tbz</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
