<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Google Chrome disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>lan.sciurus.autopkg.munki.GoogleChrome</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GoogleChrome</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Google Chrome ist ein schneller, einfacher und sicherer Webbrowser - gemacht für das moderne Internet.</string>
            <key>display_name</key>
            <string>Google Chrome</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>Browser</string>
            <key>developer</key>
            <string>Google Inc.</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>lan.sciurus.autopkg.download.GoogleChrome</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>Office/Browsers/Google Chrome</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
