<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Spectacle.</string>
	<key>Identifier</key>
	<string>lan.sciurus.download.Spectacle</string>
	<key>Input</key>
	<dict>
		<key>PRODUCT_DOWNLOAD_URL</key>
		<string>https://www.spectacleapp.com</string>
		<key>NAME</key>
		<string>Spectacle</string>
		<key>PRODUCT_RE_PATTERN</key>
		<string>.a.+href="(https://s3.amazonaws.com/spectacle/downloads/Spectacle.[\d\.]+.zip)"</string>
<!--
        https://s3.amazonaws.com/spectacle/downloads/Spectacle+1.0.1.zip
        <a class="button" href="https://s3.amazonaws.com/spectacle/downloads/Spectacle+1.0.1.zip" onclick="var that = this; _gaq.push(['_trackEvent', 'Download', 'Spectacle', this.href]); setTimeout(function() { location.href = that.href; }, 200); return false;">Download Spectacle</a>
 -->
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%PRODUCT_RE_PATTERN%</string>
				<key>result_output_var_name</key>
				<string>FILE_DOWNLOAD_URL</string>
				<key>url</key>
				<string>%PRODUCT_DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>CURLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%FILE_DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/%NAME%.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.divisiblebyzero.Spectacle" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = P8TAT4Q25S)</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/%NAME%.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
