<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for GPGSuite.</string>
        <key>Identifier</key>
        <string>lan.sciurus.download.GPGSuite.beta</string>
        <key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
        <true />
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>GPGSuite</string>
            <key>URL</key>
            <string>https://gpgtools.org/news.html</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.3.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%URL%</string>
                    <key>re_pattern</key>
                    <string>href=\"https://releases.gpgtools.org/GPG_Suite-([0-9]+.[0-9a-z-]*)\.dmg"</string>
                    <key>result_output_var_name</key>
                    <string>version</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://releases.gpgtools.org/GPG_Suite-%version%.dmg</string>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Lukas Pitschl (PKV8ZPD836)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                    <key>input_path</key>
                    <string>%pathname%/Install.pkg</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>
