<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads GPGSuite and imports into Munki.</string>
        <key>Identifier</key>
        <string>lan.sciurus.munki.GPGSuite.beta</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>Tools/System/%NAME%</string>
            <key>MUNKI_CATEGORY</key>
            <string>Utilities</string>
            <key>NAME</key>
            <string>GPGSuite Beta</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>Everything you need to get started with secure communication and encrypting files in one simple package.</string>
                <key>developer</key>
                <string>GPGTools</string>
                <key>display_name</key>
                <string>GPGSuite Beta</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>minimum_os_version</key>
                <string>10.6.0</string>
                <key>blocking_applications</key>
                <array>
                    <string>Mail</string>
                    <string>Postbox</string>
                    <string>Thunderbird</string>
                    <string>gpg</string>
                    <string>GPG</string>
                </array>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>lan.sciurus.download.GPGSuite.beta</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>flat_pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Install.pkg</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                </dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/GPGKeychain_Core.pkg/Payload</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
                </dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/GPGMail_Core.pkg/Payload</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                </dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>faux_root</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>installs_item_paths</key>
                    <array>
                        <string>/Applications/GPG Keychain.app</string>
                        <string>/Library/Application Support/GPGTools/GPGMail_Updater.app</string>
                    </array>
                    <key>version_comparison_key</key>
                    <string>CFBundleVersion</string>
                </dict>
                <key>Processor</key>
                <string>MunkiInstallsItemsCreator</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
