<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Verify recipe for GPGSuite.</string>
        <key>Identifier</key>
        <string>lan.sciurus.verify.GPGSuite</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>GPGSuite</string>
            <key>KEYID</key>
            <string>00D026C4</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>lan.sciurus.download.GPGSuite</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://releases.gpgtools.org/GPG_Suite-%version%.dmg.sig</string>
                    <key>filename</key>
                    <string>%NAME%.dmg.sig</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>lan.sciurus.SharedProcessors/GPGSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>public_key_id</key>
                    <string>%KEYID%</string>
                    <key>distribution_file</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
                    <key>signature_file</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg.sig</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
