<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Mattermost disk image and imports into munki.</string>
	<key>Identifier</key>
	<string>lan.sciurus.munki.Mattermost</string>
	<key>Input</key>
	<dict>
		<key>display_name</key>
		<string>%NAME%</string>
		<key>NAME</key>
		<string>Mattermost</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Tools/Kommunikation/%NAME%</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>lan.sciurus.download.Mattermost</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>DmgCreator</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
