<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version VueScan. Defaults to 64-bit version, override by setting ARCH to '32'.</string>
    <key>Identifier</key>
    <string>lan.sciurus.download.VueScan</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>VueScan</string>
        <key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
        <true />
        <key>ARCH</key>
        <string>64</string>
        <key>SEARCH_URL</key>
        <string>https://www.hamrick.com/download.html</string>
        <key>SEARCH_PATTERN</key>
        <string>vuex32(?P&lt;vers&gt;[\d]+)\.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://d2bwyyzfw77fhf.cloudfront.net/vuex%ARCH%%vers%.dmg</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/VueScan.app</string>
                <key>requirement</key>
                <string>identifier "com.hamrick.vuescan" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5D5BXT9KP5"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
